# PartNotFoundDueToNoDuctConnectedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DuctFailures..::..PartNotFoundDueToNoDuctConnectedError Property
BuiltInFailures..::..DuctFailures Class See Also
---
"In order to find a matching part, the fitting has to be connected to a duct."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PartNotFoundDueToNoDuctConnectedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartNotFoundDueToNoDuctConnectedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PartNotFoundDueToNoDuctConnectedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DuctFailures Class
Autodesk.Revit.DB Namespace